Revit 2024 API
ComponentRepeaterIterator.GetCurrent Method
 Returns the current repeater slot.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ComponentRepeaterSlot GetCurrent()
Visual Basic
Public Function GetCurrent As ComponentRepeaterSlot
Visual C++
public:
ComponentRepeaterSlot^ GetCurrent()
Return Value
 The current slot.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  There is no current item in the iterator.
See Also
ComponentRepeaterIterator Class
Autodesk.Revit.DB Namespace